2412/tutorials/heatTransfer/chtMultiRegionFoam/solarBeamWithTrees/system/air/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // solid
    {
        name    trees;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (5  15.5 0)(10 24.5 2);
    }

    {
        name    trees;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     trees;           // cellSet
    }
);


// ************************************************************************* //
